app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT "users".* FROM "users" WHERE "users"."subdomain" = 'luismichel' LIMIT 1
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = 1
---
  def index

  	if( request.subdomain == 'www' || request.subdomain == '')
    		@articles = Article.all
    else
    		user = User.find_by_subdomain(request.subdomain)
    		@articles = Article.where( :user_id => user.id)

INSERT INTO "articles" ("title", "description", "hyperlink", "published_at", "created_at", "updated_at") VALUES ('HTC EVO View 4G tries to sneak through FCC, gets caught', 'We''re only a fortnight away from Sprint''s launch of the HTC EVO View 4G, and we were beginning to wonder if we''d see the WiMax tablet wander into Washington, DC anytime soon. Today is the day, friends, as we just dug up some test reports for the HTC PG41200 tablet with WiMAX support. While the documents don''t offer up any more juicy details, we won''t have to wait terribly long before we can fork over $400 for the privilege of holding this baby in our own hands. Head past the break for more imagery.', 'http://www.engadget.com/2011/06/10/htc-evo-view-4g-tries-to-sneak-through-fcc-gets-caught/', '2011-06-10 20:04:00.000000', '2011-06-10 20:05:39.709432', '2011-06-10 20:05:39.709432')
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save